tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf13k22_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF13K22_H_
#define _PIC18LF13K22_H_

#define SRCON0                        0
#define SRPR                          1
#define SRPS                          2
#define SRNQEN                        3
#define SRQEN                         4
#define SRCLK0                        5
#define SRCLK                         6
#define SRCLK1                        7
#define SRCLK2                        8
#define SRLEN                         9
#define SRCON1                        10
#define SRRC1E                        11
#define SRRC2E                        12
#define SRRCKE                        13
#define SRRPE                         14
#define SRSC1E                        15
#define SRSC2E                        16
#define SRSCKE                        17
#define SRSPE                         18
#define CM2CON0                       19
#define C2CH0                         20
#define C2CH                          21
#define C2CH1                         22
#define C2R                           23
#define C2SP                          24
#define C2POL                         25
#define C2OE                          26
#define C2OUT                         27
#define C2ON                          28
#define CM2CON1                       29
#define C2SYNC                        30
#define C1SYNC                        31
#define C2HYS                         32
#define C1HYS                         33
#define C2RSEL                        34
#define C1RSEL                        35
#define MC2OUT                        36
#define MC1OUT                        37
#define CM1CON0                       38
#define C1CH                          39
#define C1CH0                         40
#define C1CH1                         41
#define C1R                           42
#define C1SP                          43
#define C1POL                         44
#define C1OE                          45
#define C1OUT                         46
#define C1ON                          47
#define SSPMSK                        48
#define MSK0                          49
#define MSK                           50
#define MSK1                          51
#define MSK2                          52
#define MSK3                          53
#define MSK4                          54
#define MSK5                          55
#define MSK6                          56
#define MSK7                          57
#define SLRCON                        58
#define SLRA                          59
#define SLRB                          60
#define SLRC                          61
#define WPUA0                         62
#define WPUA                          63
#define WPUA1                         64
#define WPUA2                         65
#define WPUA3                         66
#define WPUA4                         67
#define WPUA5                         68
#define WPUB                          69
#define WPUB4                         70
#define WPUB5                         71
#define WPUB6                         72
#define WPUB7                         73
#define IOCA0                         74
#define IOCA                          75
#define IOCA1                         76
#define IOCA2                         77
#define IOCA3                         78
#define IOCA4                         79
#define IOCA5                         80
#define IOCB                          81
#define IOCB4                         82
#define IOCB5                         83
#define IOCB6                         84
#define IOCB7                         85
#define ANSEL                         86
#define ANSEL0                        87
#define ANS0                          88
#define ANS1                          89
#define ANSEL1                        90
#define ANSEL2                        91
#define ANS2                          92
#define ANSEL3                        93
#define ANS3                          94
#define ANSEL4                        95
#define ANS4                          96
#define ANSEL5                        97
#define ANS5                          98
#define ANSEL6                        99
#define ANS6                          100
#define ANSEL7                        101
#define ANS7                          102
#define ANS8                          103
#define ANSEL8                        104
#define ANSELH                        105
#define ANS9                          106
#define ANSEL9                        107
#define ANSEL10                       108
#define ANS10                         109
#define ANS11                         110
#define ANSEL11                       111
#define PORTA                         112
#define ULPWUIN                       113
#define C1INP                         114
#define AN0                           115
#define PGD                           116
#define PORTA_RA0                     117
#define CVREF                         118
#define INT0                          119
#define VREFM                         120
#define AN1                           121
#define PGC                           122
#define PORTA_RA1                     123
#define INT1                          124
#define VREFP                         125
#define C12IN0M                       126
#define PORTA_RA2                     127
#define AN2                           128
#define T0CKI                         129
#define INT2                          130
#define SRQ                           131
#define RA3                           132
#define VPP                           133
#define NOT_MCLR                      134
#define MCLR                          135
#define nMCLR                         136
#define CLKOUT                        137
#define AN3                           138
#define PORTA_RA4                     139
#define OSC2                          140
#define CLKIN                         141
#define PORTA_RA5                     142
#define T13CKI                        143
#define OSC1                          144
#define LVDIN                         145
#define PORTB                         146
#define SDA                           147
#define AN10                          148
#define SDI                           149
#define PORTB_RB4                     150
#define RX                            151
#define PORTB_RB5                     152
#define AN11                          153
#define DT                            154
#define SCL                           155
#define SCK                           156
#define PORTB_RB6                     157
#define CK                            158
#define PORTB_RB7                     159
#define TX                            160
#define PORTC                         161
#define AN4                           162
#define PORTC_RC0                     163
#define C12INP                        164
#define C2INP                         165
#define AN5                           166
#define CCP2                          167
#define C12IN1M                       168
#define PA2                           169
#define PORTC_RC1                     170
#define AN6                           171
#define P1D                           172
#define PA1                           173
#define C12IN2M                       174
#define PORTC_RC2                     175
#define AN7                           176
#define PGM                           177
#define C12IN3M                       178
#define P1C                           179
#define PORTC_RC3                     180
#define P1B                           181
#define PORTC_RC4                     182
#define CCP1                          183
#define P1A                           184
#define PORTC_RC5                     185
#define AN8                           186
#define nSS                           187
#define NOT_SS                        188
#define SS                            189
#define PORTC_RC6                     190
#define AN9                           191
#define SDO                           192
#define PORTC_RC7                     193
#define LATA                          194
#define LATA0                         195
#define LA0                           196
#define LATA1                         197
#define LA1                           198
#define LATA2                         199
#define LA2                           200
#define LATA4                         201
#define LA4                           202
#define LATA5                         203
#define LA5                           204
#define LATB                          205
#define LB4                           206
#define LATB4                         207
#define LB5                           208
#define LATB5                         209
#define LB6                           210
#define LATB6                         211
#define LB7                           212
#define LATB7                         213
#define LATC                          214
#define LATC0                         215
#define LC0                           216
#define LATC1                         217
#define LC1                           218
#define LATC2                         219
#define LC2                           220
#define LATC3                         221
#define LC3                           222
#define LATC4                         223
#define LC4                           224
#define LATC5                         225
#define LC5                           226
#define LATC6                         227
#define LC6                           228
#define LATC7                         229
#define LC7                           230
#define TRISA                         231
#define TRISA_RA0                     232
#define TRISA0                        233
#define TRISA_RA1                     234
#define TRISA1                        235
#define TRISA2                        236
#define TRISA_RA2                     237
#define TRISA_RA4                     238
#define TRISA4                        239
#define TRISA_RA5                     240
#define TRISA5                        241
#define TRISB                         242
#define TRISB4                        243
#define TRISB_RB4                     244
#define TRISB5                        245
#define TRISB_RB5                     246
#define TRISB6                        247
#define TRISB_RB6                     248
#define TRISB7                        249
#define TRISB_RB7                     250
#define TRISC                         251
#define TRISC0                        252
#define TRISC_RC0                     253
#define TRISC1                        254
#define TRISC_RC1                     255
#define TRISC2                        256
#define TRISC_RC2                     257
#define TRISC3                        258
#define TRISC_RC3                     259
#define TRISC4                        260
#define TRISC_RC4                     261
#define TRISC5                        262
#define TRISC_RC5                     263
#define TRISC6                        264
#define TRISC_RC6                     265
#define TRISC7                        266
#define TRISC_RC7                     267
#define OSCTUNE                       268
#define TUN0                          269
#define TUN                           270
#define TUN1                          271
#define TUN2                          272
#define TUN3                          273
#define TUN4                          274
#define TUN5                          275
#define PLLEN                         276
#define INTSRC                        277
#define PIE1                          278
#define TMR1IE                        279
#define TMR2IE                        280
#define CCP1IE                        281
#define SSPIE                         282
#define TXIE                          283
#define TX1IE                         284
#define RCIE                          285
#define RC1IE                         286
#define ADIE                          287
#define PIR1                          288
#define TMR1IF                        289
#define TMR2IF                        290
#define CCP1IF                        291
#define SSPIF                         292
#define TXIF                          293
#define TX1IF                         294
#define RCIF                          295
#define RC1IF                         296
#define ADIF                          297
#define IPR1                          298
#define TMR1IP                        299
#define TMR2IP                        300
#define CCP1IP                        301
#define SSPIP                         302
#define TX1IP                         303
#define TXIP                          304
#define RC1IP                         305
#define RCIP                          306
#define ADIP                          307
#define PIE2                          308
#define TMR3IE                        309
#define BCLIE                         310
#define EEIE                          311
#define C2IE                          312
#define C1IE                          313
#define CMIE                          314
#define OSCFIE                        315
#define PIR2                          316
#define TMR3IF                        317
#define BCLIF                         318
#define EEIF                          319
#define C2IF                          320
#define C1IF                          321
#define CMIF                          322
#define OSCFIF                        323
#define IPR2                          324
#define TMR3IP                        325
#define BCLIP                         326
#define EEIP                          327
#define C2IP                          328
#define C1IP                          329
#define CMIP                          330
#define OSCFIP                        331
#define EECON1                        332
#define RD                            333
#define WR                            334
#define WREN                          335
#define WRERR                         336
#define FREE                          337
#define CFGS                          338
#define EEFS                          339
#define EEPGD                         340
#define EEADR                         341
#define EEADR0                        342
#define EEADR1                        343
#define EEADR2                        344
#define EEADR3                        345
#define EEADR4                        346
#define EEADR5                        347
#define EEADR6                        348
#define EEADR7                        349
#define RCSTA                         350
#define RCD8                          351
#define RX9D                          352
#define OERR                          353
#define FERR                          354
#define ADDEN                         355
#define ADEN                          356
#define CREN                          357
#define SRENA                         358
#define SREN                          359
#define RC9                           360
#define RC8_9                         361
#define RX9                           362
#define SPEN                          363
#define TXSTA                         364
#define TXD8                          365
#define TX9D1                         366
#define TX9D                          367
#define TRMT                          368
#define TRMT1                         369
#define BRGH1                         370
#define BRGH                          371
#define SENDB1                        372
#define SENDB                         373
#define SYNC                          374
#define SYNC1                         375
#define TXEN1                         376
#define TXEN                          377
#define TX91                          378
#define TX8_9                         379
#define TX9                           380
#define CSRC1                         381
#define CSRC                          382
#define T3CON                         383
#define TMR3ON                        384
#define TMR3CS                        385
#define nT3SYNC                       386
#define NOT_T3SYNC                    387
#define T3SYNC                        388
#define SOSCEN3                       389
#define T3CCP1                        390
#define T3CKPS                        391
#define T3CKPS0                       392
#define T3CKPS1                       393
#define T3CON_RD16                    394
#define T3RD16                        395
#define RD163                         396
#define ECCP1AS                       397
#define PSSBD                         398
#define PSSBD0                        399
#define PSSBD1                        400
#define PSSAC                         401
#define PSSAC0                        402
#define PSSAC1                        403
#define ECCPAS0                       404
#define ECCPAS                        405
#define ECCPAS1                       406
#define ECCPAS2                       407
#define ECCPASE                       408
#define PWM1CON                       409
#define PDC0                          410
#define PDC                           411
#define PDC1                          412
#define PDC2                          413
#define PDC3                          414
#define PDC4                          415
#define PDC5                          416
#define PDC6                          417
#define PRSEN                         418
#define BAUDCON                       419
#define ABDEN                         420
#define W4E                           421
#define WUE                           422
#define BRG16                         423
#define SCKP                          424
#define CKTXP                         425
#define RXCKP                         426
#define DTRXP                         427
#define RCIDL                         428
#define ABDOVF                        429
#define PSTRCON                       430
#define STRA                          431
#define STRB                          432
#define STRC                          433
#define STRD                          434
#define STRSYNC                       435
#define VREFCON0                      436
#define FVR1S0                        437
#define FVR1S1                        438
#define FVR1ST                        439
#define FVR1EN                        440
#define VREFCON1                      441
#define D1NSS0                        442
#define D1NSS                         443
#define D1PSS                         444
#define D1PSS0                        445
#define D1PSS1                        446
#define DAC1OE                        447
#define D1LPS                         448
#define D1EN                          449
#define VREFCON2                      450
#define DAC1R                         451
#define DAC1R0                        452
#define DAC1R1                        453
#define DAC1R2                        454
#define DAC1R3                        455
#define DAC1R4                        456
#define CCP1CON                       457
#define CCP1M0                        458
#define CCP1M                         459
#define CCP1M1                        460
#define CCP1M2                        461
#define CCP1M3                        462
#define DC1B                          463
#define DC1B0                         464
#define DC1B1                         465
#define P1M                           466
#define P1M0                          467
#define P1M1                          468
#define ADCON2                        469
#define ADCS0                         470
#define ADCS                          471
#define ADCS1                         472
#define ADCS2                         473
#define ACQT0                         474
#define ACQT                          475
#define ACQT1                         476
#define ACQT2                         477
#define ADFM                          478
#define ADCON1                        479
#define NVCFG                         480
#define NVCFG0                        481
#define NVCFG1                        482
#define PVCFG                         483
#define PVCFG0                        484
#define CHSN3                         485
#define PVCFG1                        486
#define ADCON0                        487
#define ADON                          488
#define nDONE                         489
#define GO_nDONE                      490
#define NOT_DONE                      491
#define GODONE                        492
#define GO_DONE                       493
#define DONE                          494
#define GO_NOT_DONE                   495
#define GO                            496
#define CHS0                          497
#define CHS                           498
#define CHS1                          499
#define CHS2                          500
#define CHS3                          501
#define SSPCON2                       502
#define SEN                           503
#define RSEN                          504
#define PEN                           505
#define RCEN                          506
#define ACKEN                         507
#define ACKDT                         508
#define ACKSTAT                       509
#define GCEN                          510
#define SSPCON1                       511
#define SSPM0                         512
#define SSPM                          513
#define SSPM1                         514
#define SSPM2                         515
#define SSPM3                         516
#define CKP                           517
#define SSPEN                         518
#define SSPOV                         519
#define WCOL                          520
#define SSPSTAT                       521
