tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf13k22_tdd.h
#define BF                            522
#define UA                            523
#define R_NOT_W                       524
#define NOT_W                         525
#define nW                            526
#define RW                            527
#define nWRITE                        528
#define R                             529
#define W                             530
#define NOT_WRITE                     531
#define R_nW                          532
#define R_W                           533
#define START                         534
#define S                             535
#define STOP                          536
#define P                             537
#define A                             538
#define NOT_A                         539
#define nA                            540
#define D_A                           541
#define D_nA                          542
#define D                             543
#define DA                            544
#define D_NOT_A                       545
#define NOT_ADDRESS                   546
#define nADDRESS                      547
#define CKE                           548
#define SMP                           549
#define T2CON                         550
#define T2CKPS0                       551
#define T2CKPS                        552
#define T2CKPS1                       553
#define TMR2ON                        554
#define T2OUTPS0                      555
#define T2OUTPS                       556
#define T2OUTPS1                      557
#define T2OUTPS2                      558
#define T2OUTPS3                      559
#define PR2                           560
#define WM0                           561
#define WM1                           562
#define WAIT0                         563
#define WAIT1                         564
#define EBDIS                         565
#define T1CON                         566
#define TMR1ON                        567
#define TMR1CS                        568
#define NOT_T1SYNC                    569
#define T1SYNC                        570
#define nT1SYNC                       571
#define T1OSCEN                       572
#define SOSCEN                        573
#define T1CKPS0                       574
#define T1CKPS                        575
#define T1CKPS1                       576
#define T1RUN                         577
#define T1CON_RD16                    578
#define T1RD16                        579
#define RCON                          580
#define BOR                           581
#define NOT_BOR                       582
#define nBOR                          583
#define POR                           584
#define nPOR                          585
#define NOT_POR                       586
#define PD                            587
#define nPD                           588
#define NOT_PD                        589
#define NOT_TO                        590
#define nTO                           591
#define TO                            592
#define nRI                           593
#define NOT_RI                        594
#define RI                            595
#define SBOREN                        596
#define IPEN                          597
#define WDTCON                        598
#define SWDTE                         599
#define SWDTEN                        600
#define OSCCON2                       601
#define LFIOFS                        602
#define HFIOFL                        603
#define PRI_SD                        604
#define OSCCON                        605
#define SCS0                          606
#define SCS                           607
#define SCS1                          608
#define FLTS                          609
#define HFIOFS                        610
#define OSTS                          611
#define IRCF                          612
#define IRCF0                         613
#define IRCF1                         614
#define IRCF2                         615
#define IDLEN                         616
#define T0CON                         617
#define T0PS                          618
#define T0PS0                         619
#define T0PS1                         620
#define T0PS2                         621
#define PSA                           622
#define T0SE                          623
#define T0CS                          624
#define T08BIT                        625
#define TMR0ON                        626
#define STATUS                        627
#define C                             628
#define CARRY                         629
#define DC                            630
#define ZERO                          631
#define Z                             632
#define OV                            633
#define OVERFLOW                      634
#define N                             635
#define NEGATIVE                      636
#define INTCON3                       637
#define INT1IF                        638
#define INT1F                         639
#define INT2IF                        640
#define INT2F                         641
#define INT1E                         642
#define INT1IE                        643
#define INT2IE                        644
#define INT2E                         645
#define INT1P                         646
#define INT1IP                        647
#define INT2IP                        648
#define INT2P                         649
#define INTCON2                       650
#define RABIP                         651
#define RBIP                          652
#define TMR0IP                        653
#define INTEDG2                       654
#define INTEDG1                       655
#define INTEDG0                       656
#define nRABPU                        657
#define NOT_RABPU                     658
#define NOT_RBPU                      659
#define nRBPU                         660
#define RABPU                         661
#define INTCON                        662
#define RABIF                         663
#define RBIF                          664
#define INT0F                         665
#define INT0IF                        666
#define T0IF                          667
#define TMR0IF                        668
#define RABIE                         669
#define RBIE                          670
#define INT0E                         671
#define INT0IE                        672
#define T0IE                          673
#define TMR0IE                        674
#define PEIE                          675
#define PEIE_GIEL                     676
#define PIE                           677
#define GIEL                          678
#define GIE_GIEH                      679
#define GIE                           680
#define GIEH                          681
#define SP0                           682
#define STKPTR                        683
#define SP1                           684
#define SP2                           685
#define SP3                           686
#define SP4                           687
#define STKUNF                        688
#define STKOVF                        689
#define STKFUL                        690

#endif // _PIC18LF13K22_H_
